I'm no longer able to reproduce the issue with the latest version of localstack, or any version past 3.0.1. i believe this PR is responsible for the fix: https://github.com/localstack/localstack/pull/8268

using this tf file and using `tflocal apply`

```hcl
resource "aws_sqs_queue" "audit_log_queue" {
  name                       = "audit_log_queue"
  delay_seconds              = 0
  max_message_size           = 2048
  message_retention_seconds  = 172800 // 2 days
  visibility_timeout_seconds = 1960

  kms_master_key_id                 = "alias/aws/sqs"
  kms_data_key_reuse_period_seconds = 300

  redrive_policy = jsonencode({
    deadLetterTargetArn = aws_sqs_queue.audit_log_deadletter_queue.arn
    maxReceiveCount     = 5
  })

  redrive_allow_policy = jsonencode({
    redrivePermission = "byQueue",
    sourceQueueArns   = [aws_sqs_queue.audit_log_deadletter_queue.arn]
  })

  tags = {
    billing_tag_key       = "billing_tag_value"
    Terraform             = true
  }
}

resource "aws_sqs_queue" "audit_log_deadletter_queue" {
  name                      = "audit_log_deadletter_queue"
  delay_seconds             = 60
  max_message_size          = 262144
  message_retention_seconds = 1209600
  receive_wait_time_seconds = 5

  kms_master_key_id                 = "alias/aws/sqs"
  kms_data_key_reuse_period_seconds = 300

  tags = {
    billing_tag_key       = "billing_tag_value"
    Terraform             = true
  }
}
```

getting the following output:

```
 % tflocal apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue.audit_log_deadletter_queue will be created
  + resource "aws_sqs_queue" "audit_log_deadletter_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 60
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "audit_log_deadletter_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 5
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Terraform"       = "true"
          + "billing_tag_key" = "billing_tag_value"
        }
      + tags_all                          = {
          + "Terraform"       = "true"
          + "billing_tag_key" = "billing_tag_value"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue.audit_log_queue will be created
  + resource "aws_sqs_queue" "audit_log_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 300
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 2048
      + message_retention_seconds         = 172800
      + name                              = "audit_log_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Terraform"       = "true"
          + "billing_tag_key" = "billing_tag_value"
        }
      + tags_all                          = {
          + "Terraform"       = "true"
          + "billing_tag_key" = "billing_tag_value"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 1960
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_sqs_queue.audit_log_deadletter_queue: Creating...
aws_sqs_queue.audit_log_deadletter_queue: Still creating... [10s elapsed]
aws_sqs_queue.audit_log_deadletter_queue: Still creating... [20s elapsed]
aws_sqs_queue.audit_log_deadletter_queue: Creation complete after 25s [id=http://sqs.us-east-1.localhost.localstack.cloud:4566/000000000000/audit_log_deadletter_queue]
aws_sqs_queue.audit_log_queue: Creating...
aws_sqs_queue.audit_log_queue: Still creating... [10s elapsed]
aws_sqs_queue.audit_log_queue: Still creating... [20s elapsed]
aws_sqs_queue.audit_log_queue: Creation complete after 25s [id=http://sqs.us-east-1.localhost.localstack.cloud:4566/000000000000/audit_log_queue]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

getting the queue attributes returns the `RedriveAllowPolicy` correctly:
```console
 % awslocal sqs get-queue-attributes --queue-url http://sqs.us-east-1.localhost.localstack.cloud:4566/000000000000/audit_log_queue --attribute-names All
{
    "Attributes": {
        "ApproximateNumberOfMessages": "0",
        "ApproximateNumberOfMessagesNotVisible": "0",
        "ApproximateNumberOfMessagesDelayed": "0",
        "CreatedTimestamp": "1704391469",
        "DelaySeconds": "0",
        "LastModifiedTimestamp": "1704391469",
        "MaximumMessageSize": "2048",
        "MessageRetentionPeriod": "172800",
        "QueueArn": "arn:aws:sqs:us-east-1:000000000000:audit_log_queue",
        "ReceiveMessageWaitTimeSeconds": "0",
        "VisibilityTimeout": "1960",
        "SqsManagedSseEnabled": "true",
        "KmsDataKeyReusePeriodSeconds": "300",
        "RedriveAllowPolicy": "{\"redrivePermission\":\"byQueue\",\"sourceQueueArns\":[\"arn:aws:sqs:us-east-1:000000000000:audit_log_deadletter_queue\"]}",
        "RedrivePolicy": "{\"deadLetterTargetArn\":\"arn:aws:sqs:us-east-1:000000000000:audit_log_deadletter_queue\",\"maxReceiveCount\":5}",
        "KmsMasterKeyId": "alias/aws/sqs"
    }
}
```

closing as complete. if the issue persists in version >=3.0.1, please open a new issue with the concrete localstack version you are using and how to reproduce the issue. thanks!